Rectangular Block/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// blockMeshDict for Rectangular Block
convertToMeters 1;

L 3; // Length of the Block
B 2; // Breadth of the Block
H 1; // height of the Block
xcell #calc "$L*10";
ycell #calc "$B*10";
zcell #calc "$H*10";


vertices
(
    (0 0 0)
    (0 $B 0)
    ($L $B 0)
    ($L 0 0)
    (0 0 $H)
    (0 $B $H)
    ($L $B $H)
    ($L 0 $H)
);

blocks
(
    hex (0 3 2 1 4 7 6 5) ($xcell $ycell $zcell) simpleGrading (1 1 1)
);

edges
(
);

boundary
(    
    Walls
    {
        type wall;
        faces
        (
            (1 0 3 2)
            (1 0 4 5)
            (5 4 7 6)
            (7 6 2 3)
            (1 2 6 5)
            (0 3 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
